Tekla.Structures.Dialog.Dialogs.GetPluginFormBaseByPluginFormName(System.String)
Retrieves an instance of the form.
PluginFormName: The complete name of the plug-in form (including the plug-in name).
Returns: The existing PluginFormBase or null if it did not exist.

Tekla.Structures.Dialog.Dialogs.LoadDialogs(System.String)
Reads the PluginFormBase dialogs from all found dll files in bin\dialogs and bin\plugins.
Param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.GetAttributeFileNameAndDialogName(System.String@,System.String@)
Since AKIT doesn't allow us to transport any parameters directly, we have to fetch them from Core at this point.
AttributeFileName: The name of the attribute file.
PluginFormName: The full name of the dialog (should contain Plugin name)

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndApply(System.String)
Uses the attributes found from the attribute file as the applied values for the specified dialog.
Param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndModify(System.String)
Uses the attributes found from the attribute file as the current values for the specified dialog.
Modifies the current selected instance. Applied values for this dialog are not changed.
Param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndApply(System.String,System.String)
Loads the specified dialog's applied values from the attribute file.
AttributeFileName: The name of the attribute file.
PluginFormName: The full name of the dialog.
Returns: True on success.

Tekla.Structures.Dialog.Dialogs.LoadAttributeFileNameToDialogAndModify(System.String,System.String)
Loads the specified dialog's current values from the attribute file and modifies the current selected instance.
AttributeFileName: The name of the attribute file.
PluginFormName: The full name of the dialog.
Returns: True on success.

Tekla.Structures.Dialog.Dialogs._LastOpenedDialog
Because we don´t support multiple dialog we need to save the last opened dialog.

Tekla.Structures.Dialog.Dialogs.OpenDialog(System.String)
Opens a dialog. The name of the dialog is asked from the Tekla Structures core.
Param: Not used.
Returns: 0 always.

Tekla.Structures.Dialog.Dialogs.PerformUpdateValues(Tekla.Structures.Dialog.Dialogs.ExistingDialog)
Method for performing dialog form update values
dialog: Existing dialog.